glm-disagg/results/concurrency/agg_tp4/result_mc24.txt

==============================================
Discovering model server pods in namespace: raj-network-debug
==============================================
  Detected:     glm-agg
  Decode pod:   ms-glm-agg-llm-d-modelservice-decode-65894c7847-cj8xf
  Decode log:   results/agg_tp4//decode_mc24.log
  Metrics from: agg pod  IP: 10.244.2.66 (port: 8000)

Starting decode pod log capture to results/agg_tp4//decode_mc24.log ...

==============================================
Running Concurrency Sweep (timeout: 900s)
  Target: glm-agg | Max Concurrency: 24
==============================================
SWEEP_START
CONFIG: target=glm-agg model=RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic isl=4096 osl=256 gpu_count=4
TARGET_DURATION: 120s  MIN_PROMPTS: 200
CONCURRENCY_LEVELS: 24

CALIBRATION: concurrency=24 num_prompts=24
vllm bench serve --base-url $(just _url glm-agg) --model $(just _model glm-agg) --dataset-name random --random-input-len 4096 --random-output-len 256 --max-concurrency 24 --request-rate 4096 --seed $(date +%M%H%M%S) --num-prompts 24 --ignore-eos
#!/usr/bin/env bash
URL=$(just _url glm-agg)
RESP=$(curl -s "$URL/v1/models")
MODEL=$(echo "$RESP" | jq -r '.data[0].id' 2>/dev/null)
if [[ -z "$MODEL" || "$MODEL" == "null" ]]; then
  echo "ERROR: Could not detect model from glm-agg. Response: $RESP" >&2
  exit 1
fi
echo "$MODEL"
INFO 02-27 05:40:47 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 02-27 05:40:47 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 02-27 05:40:47 [interface.py:222] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 02-27 05:40:49 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f0a03cbeca0>, seed=40054044, num_prompts=24, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://infra-glm-agg-inference-gateway-istio.raj-network-debug.svc.cluster.local', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=24, model='RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=4096.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-b21893c5-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 02-27 05:40:51 [datasets.py:612] Sampling input_len from [4095, 4095] and output_len from [256, 256]
  0%|          | 0/24 [00:00<?, ?it/s]WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 4096.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 24
100%|██████████| 24/24 [00:14<00:00,  1.62it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     24        
Failed requests:                         0         
Maximum request concurrency:             24        
Request rate configured (RPS):           4096.00   
Benchmark duration (s):                  14.82     
Total input tokens:                      98280     
Total generated tokens:                  6144      
Request throughput (req/s):              1.62      
Output token throughput (tok/s):         414.51    
Peak output token throughput (tok/s):    1272.00   
Peak concurrent requests:                24.00     
Total token throughput (tok/s):          7045.04   
---------------Time to First Token----------------
Mean TTFT (ms):                          5773.51   
Median TTFT (ms):                        5839.40   
P99 TTFT (ms):                           10014.68  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          35.13     
Median TPOT (ms):                        34.88     
P99 TPOT (ms):                           54.73     
---------------Inter-token Latency----------------
Mean ITL (ms):                           35.13     
Median ITL (ms):                         18.94     
P99 ITL (ms):                            829.39    
==================================================
COMPUTED_NUM_PROMPTS: 200 (throughput=7045.04 tok/s, timeout=300s)

==============================================
Snapshotting Prometheus metrics (pre-benchmark)
==============================================
  queue_time:   sum=511.930626  count=1610
  prefill_time: sum=2276.395497  count=1610

BENCH_RUN: concurrency=24 num_prompts=200 timeout=300s
vllm bench serve --base-url $(just _url glm-agg) --model $(just _model glm-agg) --dataset-name random --random-input-len 4096 --random-output-len 256 --max-concurrency 24 --request-rate 4096 --seed $(date +%M%H%M%S) --num-prompts 200 --ignore-eos
#!/usr/bin/env bash
URL=$(just _url glm-agg)
RESP=$(curl -s "$URL/v1/models")
MODEL=$(echo "$RESP" | jq -r '.data[0].id' 2>/dev/null)
if [[ -z "$MODEL" || "$MODEL" == "null" ]]; then
  echo "ERROR: Could not detect model from glm-agg. Response: $RESP" >&2
  exit 1
fi
echo "$MODEL"
INFO 02-27 05:41:11 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 02-27 05:41:11 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 02-27 05:41:11 [interface.py:222] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 02-27 05:41:13 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f163220aca0>, seed=41054108, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://infra-glm-agg-inference-gateway-istio.raj-network-debug.svc.cluster.local', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=24, model='RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=4096.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-4b923ec2-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 02-27 05:41:15 [datasets.py:612] Sampling input_len from [4095, 4095] and output_len from [256, 256]
  0%|          | 0/200 [00:00<?, ?it/s]WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 4096.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 24
100%|██████████| 200/200 [02:05<00:00,  1.59it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Maximum request concurrency:             24        
Request rate configured (RPS):           4096.00   
Benchmark duration (s):                  125.53    
Total input tokens:                      819000    
Total generated tokens:                  51200     
Request throughput (req/s):              1.59      
Output token throughput (tok/s):         407.87    
Peak output token throughput (tok/s):    1278.00   
Peak concurrent requests:                31.00     
Total token throughput (tok/s):          6932.18   
---------------Time to First Token----------------
Mean TTFT (ms):                          3186.44   
Median TTFT (ms):                        3325.68   
P99 TTFT (ms):                           9618.36   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          45.21     
Median TPOT (ms):                        45.00     
P99 TPOT (ms):                           56.13     
---------------Inter-token Latency----------------
Mean ITL (ms):                           45.21     
Median ITL (ms):                         18.99     
P99 ITL (ms):                            836.42    
==================================================
BENCH_RUN_END: concurrency=24

==============================================
Sweep Completed (exit 0)
==============================================
SWEEP_END

==============================================
Snapshotting Prometheus metrics (post-benchmark)
==============================================
  queue_time:   sum=641.903005  count=1810
  prefill_time: sum=2651.671597  count=1810

==============================================
Prometheus Metrics Summary (concurrency=24)
==============================================
PROMETHEUS_METRICS: concurrency=24
  request_queue_time:   avg = 0.649862 s  (sum_delta=129.9724, count_delta=200)
  request_prefill_time: avg = 1.876381 s  (sum_delta=375.2761, count_delta=200)

Stopping log captures...
Decode log:  results/agg_tp4//decode_mc24.log (16 lines, 4.0K)